In [1]:
#union de dataframes

In [3]:
import pandas as pd

In [4]:
dataframe1=pd.DataFrame({'c1':['1','2','3'],'clave':['a','b','c']})
dataframe1

  c1 clave
0  1     a
1  2     b
2  3     c

In [5]:
dataframe2=pd.DataFrame({'C2':['4','5','6'],'clave':['c','b','e']})
dataframe2

  C2 clave
0  4     c
1  5     b
2  6     e

In [7]:
dataframe3=pd.DataFrame.merge(dataframe1,dataframe2,on='clave')
dataframe3

  c1 clave C2
0  2     b  5
1  3     c  4

In [8]:
dataframe4=pd.DataFrame.merge(dataframe1,dataframe2,on='clave',how='left')
dataframe4

  c1 clave   C2
0  1     a  NaN
1  2     b    5
2  3     c    4

In [9]:
dataframe5=dataframe4=pd.DataFrame.merge(dataframe1,dataframe2,on='clave',how='right')
dataframe5

    c1 clave C2
0    2     b  5
1    3     c  4
2  NaN     e  6

In [10]:
dataframe5=pd.DataFrame.merge(dataframe1,dataframe2,on='clave',how='outer')
dataframe5

    c1 clave   C2
0    1     a  NaN
1    2     b    5
2    3     c    4
3  NaN     e    6

In [11]:
import numpy as np

In [12]:
array1=np.arange(9).reshape(3,3)
array1

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [13]:
np.concatenate([array1,array1])

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8],
       [0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [14]:
np.concatenate([array1,array1],axis=1)

array([[0, 1, 2, 0, 1, 2],
       [3, 4, 5, 3, 4, 5],
       [6, 7, 8, 6, 7, 8]])

In [15]:
serie1=pd.Series([1,2,3],index=list('abc'))
serie1

a    1
b    2
c    3
dtype: int64

In [16]:
serie2=pd.Series([4,5,6],index=list('def'))
serie2

d    4
e    5
f    6
dtype: int64

In [17]:
pd.concat([serie1,serie2])

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [18]:
pd.concat([serie1,serie2],keys=['serie1','serie2'])

serie1  a    1
        b    2
        c    3
serie2  d    4
        e    5
        f    6
dtype: int64

In [19]:
dataframe1=pd.DataFrame(np.random.rand(3,3),columns=list('abc'))
dataframe1

          a         b         c
0  0.379777  0.603893  0.065765
1  0.422222  0.399826  0.083205
2  0.861390  0.932623  0.016624

In [20]:
dataframe2=pd.DataFrame(np.random.rand(2,3),columns=list('abc'))
dataframe2

          a         b         c
0  0.626384  0.480214  0.418359
1  0.643538  0.534050  0.788123

In [21]:
dataframe3=pd.concat([dataframe1,dataframe2])
dataframe3

          a         b         c
0  0.379777  0.603893  0.065765
1  0.422222  0.399826  0.083205
2  0.861390  0.932623  0.016624
0  0.626384  0.480214  0.418359
1  0.643538  0.534050  0.788123

In [22]:
dataframe3=pd.concat([dataframe1,dataframe2],ignore_index=True)
dataframe3

          a         b         c
0  0.379777  0.603893  0.065765
1  0.422222  0.399826  0.083205
2  0.861390  0.932623  0.016624
3  0.626384  0.480214  0.418359
4  0.643538  0.534050  0.788123

In [23]:
serie1=pd.Series([1,2,np.nan])
serie1
serie2=pd.Series([4,5,6])
serie2
serie3=serie1.combine_first(serie2)
serie3

0    1.0
1    2.0
2    6.0
dtype: float64

In [24]:
lista_valores=[1,2,np.nan]
dataframe1=pd.DataFrame(lista_valores)
dataframe1

     0
0  1.0
1  2.0
2  NaN

In [25]:
lista_valores_2=[4,5,6]
dataframe_2=pd.DataFrame(lista_valores_2)
dataframe_2

   0
0  4
1  5
2  6

In [26]:
dataframe_3=dataframe1.combine_first(dataframe_2)
dataframe_3

     0
0  1.0
1  2.0
2  6.0

In [27]:
#eliminar duplicados en Dataframe

In [28]:
lista_valores=[[1,2],[1,2],[5,6],[5,8]]
lista_valores

[[1, 2], [1, 2], [5, 6], [5, 8]]

In [29]:
lista_indices=list('mnop')
lista_indices

['m', 'n', 'o', 'p']

In [30]:
lista_columnas=['valor1','valor2']

In [31]:
lista_columnas

['valor1', 'valor2']

In [32]:
dataframe=pd.DataFrame(lista_valores,index=lista_indices,columns=lista_columnas)
dataframe

   valor1  valor2
m       1       2
n       1       2
o       5       6
p       5       8

In [34]:
dataframe2=dataframe.drop_duplicates()
dataframe2

   valor1  valor2
m       1       2
o       5       6
p       5       8

In [35]:
dataframe2.drop_duplicates(['valor1'])

   valor1  valor2
m       1       2
o       5       6

In [36]:
dataframe2.drop_duplicates(['valor1'],keep='last')

   valor1  valor2
m       1       2
p       5       8

In [37]:
serie1=pd.Series([1,2,3,4,5],index=list('abcde'))
serie1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [38]:
serie1.replace(1,6)

a    6
b    2
c    3
d    4
e    5
dtype: int64

In [39]:
serie1=serie1.replace(1,6)

In [40]:
serie1=serie1.replace({2:8,3:9})
serie1

a    6
b    8
c    9
d    4
e    5
dtype: int64

In [41]:
lista_valores=np.arange(9).reshape(3,3)
lista_valores

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [42]:
lista_indices=list('abc')
lista_indices

['a', 'b', 'c']

In [57]:
dataframe=pd.DataFrame(lista_valores,index=lista_indices)
dataframe

   0  1  2
a  0  1  2
b  3  4  5
c  6  7  8

In [45]:
nuevos_indices=dataframe.index.map(str.upper)
dataframe.index=nuevos_indices

In [46]:
dataframe

   0  1  2
A  0  1  2
B  3  4  5
C  6  7  8

In [47]:
dataframe=dataframe.rename(index=str.lower)
dataframe

   0  1  2
a  0  1  2
b  3  4  5
c  6  7  8

In [56]:
dataframe

In [62]:
nuevos_indices={'b':'j'}
dataframe.rename(index=nuevos_indices,inplace=True)

In [63]:
dataframe

   0  1  2
a  0  1  2
j  3  4  5
c  6  7  8